---
type: EndTreatmentType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# EndTreatmentType

`Autodesk.Revit.DB.Structure.EndTreatmentType` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | CreateDefaultEndTreatmentType | 2017 | `public static ElementId CreateDefaultEndTreatmentType ( Document ADoc )` |
| Property | EndTreatment | 2017 | `public string EndTreatment { get ; set ; }` |
| Property | Parameter | — | `` |